# Index_Object

In [1]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series(np.arange(5),index = ['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [4]:
index1 = obj.index

In [6]:
index1

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
index1[2:] # Index objects are immutable and thus canâ€™t be modified by the user.

Index(['c', 'd', 'e'], dtype='object')

In [11]:

labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [14]:
obj1 = pd.Series([0.4,0.5,0.6],index  = labels)
obj1

0    0.4
1    0.5
2    0.6
dtype: float64

In [17]:
obj1.index is labels

True

# Essential Functionality

# Reindexing

An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index

In [18]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [19]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [21]:
obj1 = obj.reindex(['a','b','c','d','e'])
obj1

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

ffill method which fill the foward fill the values.

In [29]:
obj2 = pd.Series(["red","blue","purple"],index = [0,2,4])
obj2

0       red
2      blue
4    purple
dtype: object

In [30]:
obj3 = obj2.reindex(range(7),method= "ffill")
obj3

0       red
1       red
2      blue
3      blue
4    purple
5    purple
6    purple
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed only a sequence, it reindexes the rows in the result:

In [33]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index =[1,2,3],columns = ["ohio","texas","calforina"])

In [34]:
frame

   ohio  texas  calforina
1     0      1          2
2     3      4          5
3     6      7          8

In [35]:
frame1 = frame.reindex([2,3,1]) # row reindexing

In [37]:
frame1

   ohio  texas  calforina
2     3      4          5
3     6      7          8
1     0      1          2

In [39]:
# The columns can be reindexed with the columns keyword
frame2 = frame.reindex(columns=["texas","calforina","ohio"])
frame2

   texas  calforina  ohio
1      1          2     0
2      4          5     3
3      7          8     6

In [41]:
frame.loc[[2,1,3], ["texas","calforina","ohio"]] 
# As weâ€™ll explore in more detail, you can reindex more succinctly by label-indexing
#with loc, and many users prefer to use it exclusively:

   texas  calforina  ohio
2      4          5     3
1      1          2     0
3      7          8     6

# Dropping Entries from an Axis

Delete the entries.
Drop method will return a new object with the indicated value or values deleted from the axis.

Note::
1: The drop will create the new object.The original will not  get affected.
2: you can drop the values from the column by passing  axis = 0 or axis = "columns" in DataFrame.
3: if you use inplace in drop method this wonot return a new object rather put effect on the original one.

In [45]:
obj4 = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj4

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [48]:
new_obj = obj4.drop("c")

In [49]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [52]:
obj4.drop(["b","e"])

a    0.0
c    2.0
d    3.0
dtype: float64

In [53]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [85]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'])
data

           0   1   2   3
Ohio       0   1   2   3
Colorado   4   5   6   7
Utah       8   9  10  11
New York  12  13  14  15

In [86]:
#Calling drop with a sequence of labels will drop values from the row labels (axis 0).
# data.drop(["Ohio","Utah"])  METHOD 1
data.drop(["New York","Ohio"],axis = 0) # method 2

          0  1   2   3
Colorado  4  5   6   7
Utah      8  9  10  11

In [88]:
#Calling drop with a sequence of labels will drop values from the column labels (axis 1):
#data.drop([0,3], axis = 1,inplace= True) # method 1 
data.drop([0,3],axis ="columns") # method 2

           1   2
Ohio       1   2
Colorado   5   6
Utah       9  10
New York  13  14

In [89]:
data

           0   1   2   3
Ohio       0   1   2   3
Colorado   4   5   6   7
Utah       8   9  10  11
New York  12  13  14  15

# Indexing, Selection, and Filtering

In [90]:
obj

a    0.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [91]:
obj["b"]

5.0

In [92]:
obj[1]

5.0

In [93]:
obj["c":'e']
#Slicing with labels behaves differently than normal Python slicing in that the endpoint
#is inclusive.

c    5.0
d    5.0
e    5.0
dtype: float64

In [94]:
obj[2:5]

c    5.0
d    5.0
e    5.0
dtype: float64

In [95]:
obj[["e","c","a"]]

e    5.0
c    5.0
a    0.0
dtype: float64

In [96]:
obj[obj>2]

b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [97]:
obj["b":"e"] = 5

In [98]:
obj

a    0.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single
value or sequence

In [99]:
data

           0   1   2   3
Ohio       0   1   2   3
Colorado   4   5   6   7
Utah       8   9  10  11
New York  12  13  14  15

In [101]:
data[0:3]

          0  1   2   3
Ohio      0  1   2   3
Colorado  4  5   6   7
Utah      8  9  10  11

In [102]:
data[[2,1]]

           2   1
Ohio       2   1
Colorado   6   5
Utah      10   9
New York  14  13

In [103]:
data[data<3]

            0    1    2   3
Ohio      0.0  1.0  2.0 NaN
Colorado  NaN  NaN  NaN NaN
Utah      NaN  NaN  NaN NaN
New York  NaN  NaN  NaN NaN

In [104]:
data[:2]

          0  1  2  3
Ohio      0  1  2  3
Colorado  4  5  6  7

In [106]:
data[2]

Ohio         2
Colorado     6
Utah        10
New York    14
Name: 2, dtype: int32